Project/Toir.Adaptation/src/Reports/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b7320fcb-d548-4601-9a7c-f8afd914b08c">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_СтатусыДокументовВыявленныхДефектовУстановленные/торо_СтатусыДокументовВыявленныхДефектовУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыДокументовВыявленныхДефектовУстановленные</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИзменяемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Reports/торо_ВыявленныеДефекты/ObjectModule.bsl
&ИзменениеИКонтроль("ПолучитьСодержательнуюЧастьЗапроса")
Функция Расш_гкс_ПолучитьСодержательнуюЧастьЗапроса()

	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефекты.ДефектПричина КАК ДефектПричина,
	#Вставка
	|	торо_ВыявленныеДефекты.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	|	торо_ВыявленныеДефекты.Регистратор.гкс_НомерТАГ КАК НомерТАГ,
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	#КонецВставки
	|	торо_ВыявленныеДефекты.Регистратор.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефекты.ВидДефекта КАК ВидДефекта,
	|	ВЫБОР
	|		КОГДА торо_Ремонты.Регистратор ЕСТЬ NULL
	|			ТОГДА ""Нет оформленных заявок""
	|		ИНАЧЕ торо_Ремонты.Регистратор
	|	КОНЕЦ КАК ОформленнаяЗаявка,
	|	торо_ВыявленныеДефекты.Регистратор КАК Документ,
	|	торо_ВыявленныеДефекты.Период КАК Дата,
	|	торо_ВыявленныеДефекты.ОбъектРемонта КАК НеисправныйОбъектРемонта,
	|	торо_ВыявленныеДефекты.ID КАК ID,
	|	Описание.ДефектОписание КАК ОписаниеДефекта,
	|	Описание.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ОтмененныеРемонты.Отменен КАК Закрыт,
	|	торо_ОтмененныеРемонты.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	|	Описание.ПоследствияДефекта КАК ПоследствияДефекта,
	|	Описание.НаправлениеНаУстранение КАК НаправлениеНаУстранение
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_Ремонты.ID
	|			И (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК Описание
	|		ПО (Описание.ID = торо_ВыявленныеДефекты.ID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты КАК торо_ОтмененныеРемонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_ОтмененныеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовВыявленныхДефектовУстановленные.СрезПоследних(, ) КАК торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних
	|		ПО торо_ВыявленныеДефекты.Регистратор = торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних.ИзменяемыйДокумент
	|{ГДЕ
	|	(торо_ВыявленныеДефекты.Период МЕЖДУ &ДатаНач И &ДатаКон)}"

	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ЗапросТекст;

КонецФункции

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура Расш_гкс_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);

	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяСтруктураИерархии",
		Справочники.торо_СтруктурыОР.ПустаяСсылка());

		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;

	КонецЕсли;

	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаКон");
	#Вставка
	СдвигЧП = 0;
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СдвигЧП") Тогда 
		СдвигЧП = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СдвигЧП;
	КонецЕсли;
	#КонецВставки

	Если ТекИерархия.СтроитсяАвтоматически Тогда

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТ_Данные.ДефектПричина КАК ДефектПричина,
		|	ВТ_Данные.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
		|	ВТ_Данные.ВидДефекта КАК ВидДефекта,
		|	ВТ_Данные.ОформленнаяЗаявка КАК ОформленнаяЗаявка,
		|	ВТ_Данные.Документ КАК Документ,
		#Вставка
		|	ДобавитьКДате(ВТ_Данные.Дата, Час, " + СдвигЧП + ") КАК Дата,
		// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
		|	ВТ_Данные.НомерТАГ КАК НомерТАГ,
		// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		#КонецВставки
		#Удаление
		|	ВТ_Данные.Дата КАК Дата,
		#КонецУдаления
		|	ВТ_Данные.НеисправныйОбъектРемонта КАК НеисправныйОбъектРемонта,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.ОписаниеДефекта КАК ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_Данные.Закрыт КАК Закрыт,
		#Вставка
		|	ВТ_Данные.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
		#КонецВставки
		|	ВТ_Данные.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Данные.СтатусДокумента КАК СтатусДокумента,
		|	ВТ_Данные.ПоследствияДефекта КАК ПоследствияДефекта,
		|	ВТ_Данные.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
		|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);

	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТ_Данные.ДефектПричина КАК ДефектПричина,
		|	ВТ_Данные.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
		|	ВТ_Данные.ВидДефекта КАК ВидДефекта,
		|	ВТ_Данные.ОформленнаяЗаявка КАК ОформленнаяЗаявка,
		|	ВТ_Данные.Документ КАК Документ,
		#Вставка
		|	ДобавитьКДате(ВТ_Данные.Дата, Час, " + СдвигЧП + ") КАК Дата,
		// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
		|	ВТ_Данные.НомерТАГ КАК НомерТАГ,
		// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		#КонецВставки
		#Удаление
		|	ВТ_Данные.Дата КАК Дата,
		#КонецУдаления
		|	ВТ_Данные.НеисправныйОбъектРемонта КАК НеисправныйОбъектРемонта,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.ОписаниеДефекта КАК ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_Данные.Закрыт КАК Закрыт,
		#Вставка
		|	ВТ_Данные.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
		#КонецВставки
		|	ВТ_Данные.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Данные.СтатусДокумента КАК СтатусДокумента,
		|	ВТ_Данные.ПоследствияДефекта КАК ПоследствияДефекта,
		|	ВТ_Данные.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";

	КонецЕсли;

КонецПроцедуры
